<?php

$a = [
"是",
"个",
"男",
"的",
"都",
"喜欢",
"杉菜",
"個",
"喜歡",
"是个男的都喜欢杉菜",
];
$a = [
"锦",
"觅",
"凤凰",
"合法",
"灵",
"修",
"錦",
"覓",
"鳳凰",
"靈",
];

build_trie($a);

//for ($i = 0; $i < 10000; $i++) {
    //$str = "只有我一个人觉得新版流星花园里的杉菜就是个白莲花吗，动不动就跟男的搞暧昧，一下喜欢这个一下喜欢那个，跟各种男配角不明不白，动不动就冷战一副唯我独尊你就是得捧着我的感觉，现在国产剧的剧情都是怎么了，超级心疼鹤棣弟弟的好吗，又是一部三观不正的电视剧，只能拿来当综艺看看欣赏一下男主的颜";

$str = '<a class="" href="http://s.weibo.com/weibo/%23%E9%94%A6%E8%A7%85%E5%87%A4%E5%87%B0%E5%90%88%E6%B3%95%E7%81%B5%E4%BF%AE%23"  target="_blank">#锦觅凤凰合法灵修#</a>这么甜的糖居然又被润玉粉骂！！！我灵修夫妇凡间领证，合法圆房哪里有错？更何况锦觅从凡间回来就有了想取消婚约的想法，从她不愿意让润玉亲那里就知道了！再说没有下凡间的时候，润玉粉说锦觅有了婚约还和凤凰牵扯不清的，脑子是秀逗了吧？锦觅那会灭情绝爱，压根不懂婚约是要做什么好吧？在她心里都是朋友，那凭什么就不能和凤凰玩了，而我凤凰那会也只是想问清楚锦觅的心意，也没有做什么出格的事情，骂个屁啊！反倒润玉口口声声“友人二字问心无愧”，结果转眼骗婚，这一手操作6啊！口口声声谁都不能剥夺锦觅爱的权利，转眼修复陨丹让锦觅灭情绝爱，这人设崩的不要太厉害了！说复仇的，你冲着天帝天后复啊（别忘了天帝可不止是凤凰的爹，还是润玉的爹啊！都能杀亲爹了和穗禾有什么区别），骗锦觅杀凤凰干嘛？这真的一身黑吧！凤凰没有半分对不起润玉好吧！';

    echo markred($str) . PHP_EOL;
//}
